/*************************************************************************************
1085 직사각형에서 탈출

1. 사각형 내부에 x,y가 주어짐(조건 참고)
2. 벽면에 가장 가까운 거리를 찾으면 된다(최소값)

>> 최소값, 좌표

Created by 권상훈
*************************************************************************************/

#include<iostream>
using namespace std;

int main() {
    int x, y, w, h;
    cin >> x >> y >> w >> h;

    int min = x;
    if (min > y) min = y;
    if (min > w - x) min = w - x;
    if (min > h - y) min = h - y;

    cout << min;
    return 0;
}
